In [1]:
import pandas as pd

### Create a Series

In [3]:
s = pd.Series([67,23,18,43,28,64,25,10,39])

In [4]:
s

0    67
1    23
2    18
3    43
4    28
5    64
6    25
7    10
8    39
dtype: int64

In [5]:
type(s)

pandas.core.series.Series

In [6]:
s[6]

25

In [7]:
s[6] = 34

In [8]:
s

0    67
1    23
2    18
3    43
4    28
5    64
6    34
7    10
8    39
dtype: int64

In [9]:
s = pd.Series([67,23,18,43,28,64,25,10,39], index=range(100,109))

In [10]:
s

100    67
101    23
102    18
103    43
104    28
105    64
106    25
107    10
108    39
dtype: int64

In [11]:
d = {3:123,6:789,5:190,11:456,23:617} # dict

In [12]:
d

{3: 123, 6: 789, 5: 190, 11: 456, 23: 617}

In [14]:
d1 = pd.Series(d)

In [15]:
d1

3     123
6     789
5     190
11    456
23    617
dtype: int64

### DataFrame

In [18]:
x = pd.Series(range(1,6))
y = pd.Series(['Anil','Sunil','Anita','Sunita','Prem'])
z = pd.Series([67.88, 87.34, 48.67, 65.78, 72.45])

In [19]:
df = pd.DataFrame({
    'roll': x,
    'name': y,
    'marks': z
})

In [20]:
df

   roll    name  marks
0     1    Anil  67.88
1     2   Sunil  87.34
2     3   Anita  48.67
3     4  Sunita  65.78
4     5    Prem  72.45

In [21]:
type(df)

pandas.core.frame.DataFrame

In [22]:
import os
os.getcwd()

'/home/mitu'

### Import the data

In [24]:
df = pd.read_csv('student.csv')

In [25]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [29]:
pd.read_csv('student3.tsv', sep='\t')

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [34]:
pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data', 
            names=['A','B','C','D','E'], nrows=20)

      A    B    C    D            E
0   5.1  3.5  1.4  0.2  Iris-setosa
1   4.9  3.0  1.4  0.2  Iris-setosa
2   4.7  3.2  1.3  0.2  Iris-setosa
3   4.6  3.1  1.5  0.2  Iris-setosa
4   5.0  3.6  1.4  0.2  Iris-setosa
5   5.4  3.9  1.7  0.4  Iris-setosa
6   4.6  3.4  1.4  0.3  Iris-setosa
7   5.0  3.4  1.5  0.2  Iris-setosa
8   4.4  2.9  1.4  0.2  Iris-setosa
9   4.9  3.1  1.5  0.1  Iris-setosa
10  5.4  3.7  1.5  0.2  Iris-setosa
11  4.8  3.4  1.6  0.2  Iris-setosa
12  4.8  3.0  1.4  0.1  Iris-setosa
13  4.3  3.0  1.1  0.1  Iris-setosa
14  5.8  4.0  1.2  0.2  Iris-setosa
15  5.7  4.4  1.5  0.4  Iris-setosa
16  5.4  3.9  1.3  0.4  Iris-setosa
17  5.1  3.5  1.4  0.3  Iris-setosa
18  5.7  3.8  1.7  0.3  Iris-setosa
19  5.1  3.8  1.5  0.3  Iris-setosa

In [37]:
df.shape

(10, 5)

In [38]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [39]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [40]:
df.ndim

2

In [41]:
df.size

50

In [42]:
df.values

array([[1, 'anil', 'TE', 56.77, 22],
       [2, 'amit', 'TE', 59.77, 21],
       [3, 'aniket', 'BE', 76.88, 19],
       [4, 'ajinkya', 'TE', 69.66, 20],
       [5, 'asha', 'TE', 63.28, 20],
       [6, 'ayesha', 'BE', 49.55, 20],
       [7, 'amar', 'BE', 65.34, 19],
       [8, 'amita', 'BE', 68.33, 23],
       [9, 'amol', 'TE', 56.75, 20],
       [10, 'anmol', 'BE', 78.66, 21]], dtype=object)

In [44]:
s.values

array([67, 23, 18, 43, 28, 64, 25, 10, 39])

In [45]:
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [46]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [47]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [48]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [49]:
df.tail(3)

   roll   name class  marks  age
7     8  amita    BE  68.33   23
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21

In [50]:
df.sum()

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [51]:
df.sum(axis=1)

0     79.77
1     82.77
2     98.88
3     93.66
4     88.28
5     75.55
6     91.34
7     99.33
8     85.75
9    109.66
dtype: float64

In [52]:
df.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [53]:
df.min()

roll           1
name     ajinkya
class         BE
marks      49.55
age           19
dtype: object

In [54]:
df.median()

roll      5.50
marks    64.31
age      20.00
dtype: float64

In [55]:
import numpy as np

In [60]:
x = np.array([12,17,4,23,16,31,19,10])

In [61]:
np.median(x)

16.5

In [62]:
np.sort(x)

array([ 4, 10, 12, 16, 17, 19, 23, 31])

In [63]:
df.mean()

roll      5.500
marks    64.499
age      20.500
dtype: float64

In [64]:
df.mode()

   roll     name class  marks   age
0     1  ajinkya    BE  49.55  20.0
1     2     amar    TE  56.75   NaN
2     3     amit   NaN  56.77   NaN
3     4    amita   NaN  59.77   NaN
4     5     amol   NaN  63.28   NaN
5     6   aniket   NaN  65.34   NaN
6     7     anil   NaN  68.33   NaN
7     8    anmol   NaN  69.66   NaN
8     9     asha   NaN  76.88   NaN
9    10   ayesha   NaN  78.66   NaN

In [65]:
df.std()

roll     3.027650
marks    9.207179
age      1.269296
dtype: float64

In [67]:
df.count()

roll     10
name     10
class    10
marks    10
age      10
dtype: int64

In [68]:
df.info()

TypeError: Cannot interpret '<attribute 'dtype' of 'numpy.generic' objects>' as a data type

In [70]:
s = pd.Series([56,12,45,'A',56,78])

In [71]:
s

0    56
1    12
2    45
3     A
4    56
5    78
dtype: object

In [72]:
type(s[2])

int

### Slicing - index based

In [74]:
x = df.iloc[2:7,1:4]

In [75]:
x

      name class  marks
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34

In [76]:
df.iloc[2:,1:4]

      name class  marks
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75
9    anmol    BE  78.66

In [77]:
df.iloc[2:,1:]

      name class  marks  age
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20
5   ayesha    BE  49.55   20
6     amar    BE  65.34   19
7    amita    BE  68.33   23
8     amol    TE  56.75   20
9    anmol    BE  78.66   21

In [78]:
df.iloc[:7,1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34

In [79]:
df.iloc[:7,:]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19

In [80]:
df.iloc[[2,4,7,8],1:4]

     name class  marks
2  aniket    BE  76.88
4    asha    TE  63.28
7   amita    BE  68.33
8    amol    TE  56.75

In [81]:
df.iloc[[2,4,7,8],[2,3,0]]

  class  marks  roll
2    BE  76.88     3
4    TE  63.28     5
7    BE  68.33     8
8    TE  56.75     9

In [84]:
df.iloc[3,:]

roll           4
name     ajinkya
class         TE
marks      69.66
age           20
Name: 3, dtype: object

In [85]:
df.iloc[:,2]

0    TE
1    TE
2    BE
3    TE
4    TE
5    BE
6    BE
7    BE
8    TE
9    BE
Name: class, dtype: object

### Slicing - label based

In [83]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [86]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [87]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [89]:
df[['name','age','marks']]

      name  age  marks
0     anil   22  56.77
1     amit   21  59.77
2   aniket   19  76.88
3  ajinkya   20  69.66
4     asha   20  63.28
5   ayesha   20  49.55
6     amar   19  65.34
7    amita   23  68.33
8     amol   20  56.75
9    anmol   21  78.66

In [90]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [91]:
df.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [92]:
df.drop([5,7,8])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
9    10    anmol    BE  78.66   21

In [94]:
df.drop('class', axis = 1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [95]:
df.drop(['class','age'], axis = 1)

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

In [96]:
df['marks'].mean()

64.499

In [97]:
df['marks'].max()

78.66

In [98]:
df['marks'].min()

49.55

In [99]:
df['marks'].median()

64.31

In [100]:
df['marks'].sum()

644.9899999999999

In [101]:
df.rename(index={0:'Zero',5:'Five',9:'Nine'})

      roll     name class  marks  age
Zero     1     anil    TE  56.77   22
1        2     amit    TE  59.77   21
2        3   aniket    BE  76.88   19
3        4  ajinkya    TE  69.66   20
4        5     asha    TE  63.28   20
Five     6   ayesha    BE  49.55   20
6        7     amar    BE  65.34   19
7        8    amita    BE  68.33   23
8        9     amol    TE  56.75   20
Nine    10    anmol    BE  78.66   21

In [102]:
df.rename(columns={'roll':'id','class':'year','marks':'CGPA'})

   id     name year   CGPA  age
0   1     anil   TE  56.77   22
1   2     amit   TE  59.77   21
2   3   aniket   BE  76.88   19
3   4  ajinkya   TE  69.66   20
4   5     asha   TE  63.28   20
5   6   ayesha   BE  49.55   20
6   7     amar   BE  65.34   19
7   8    amita   BE  68.33   23
8   9     amol   TE  56.75   20
9  10    anmol   BE  78.66   21

In [103]:
for data in df:
    print(data)

roll
name
class
marks
age

In [104]:
for data in df:
    print(data,'\n',df[data])

roll
 0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: roll, dtype: int64
name
 0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object
class
 0    TE
1    TE
2    BE
3    TE
4    TE
5    BE
6    BE
7    BE
8    TE
9    BE
Name: class, dtype: object
marks
 0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64
age
 0    22
1    21
2    19
3    20
4    20
5    20
6    19
7    23
8    20
9    21
Name: age, dtype: int64

In [105]:
for key, value in df.iteritems():
    print(key, value)

roll 0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: roll, dtype: int64
name 0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object
class 0    TE
1    TE
2    BE
3    TE
4    TE
5    BE
6    BE
7    BE
8    TE
9    BE
Name: class, dtype: object
marks 0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64
age 0    22
1    21
2    19
3    20
4    20
5    20
6    19
7    23
8    20
9    21
Name: age, dtype: int64

In [106]:
df.sort_values(by='class')

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [108]:
df.sort_values(by='class', ascending=False)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20
2     3   aniket    BE  76.88   19
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [110]:
df.sort_values(by=['class','age','marks'])

   roll     name class  marks  age
6     7     amar    BE  65.34   19
2     3   aniket    BE  76.88   19
5     6   ayesha    BE  49.55   20
9    10    anmol    BE  78.66   21
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
4     5     asha    TE  63.28   20
3     4  ajinkya    TE  69.66   20
1     2     amit    TE  59.77   21
0     1     anil    TE  56.77   22

In [112]:
df['name'].str.upper()

0       ANIL
1       AMIT
2     ANIKET
3    AJINKYA
4       ASHA
5     AYESHA
6       AMAR
7      AMITA
8       AMOL
9      ANMOL
Name: name, dtype: object

In [113]:
df['name'].str.title()

0       Anil
1       Amit
2     Aniket
3    Ajinkya
4       Asha
5     Ayesha
6       Amar
7      Amita
8       Amol
9      Anmol
Name: name, dtype: object

In [114]:
df['name'].str.replace('i','ee')

0       aneel
1       ameet
2     aneeket
3    ajeenkya
4        asha
5      ayesha
6        amar
7      ameeta
8        amol
9       anmol
Name: name, dtype: object

In [115]:
df['name'].str.startswith('an')

0     True
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: name, dtype: bool

### Boolean filtering

In [118]:
mask = df['marks'] > 60

In [119]:
df[mask]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [120]:
df[df['marks'] > 60]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [121]:
df[(df['marks'] > 60) & (df['class'] == 'BE')]

   roll    name class  marks  age
2     3  aniket    BE  76.88   19
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
9    10   anmol    BE  78.66   21

In [122]:
df[df['name'].str.startswith('an')]

   roll    name class  marks  age
0     1    anil    TE  56.77   22
2     3  aniket    BE  76.88   19
9    10   anmol    BE  78.66   21

### Export the data

In [124]:
x = df[(df['marks'] > 60) & (df['class'] == 'BE')]
x.to_csv('output.csv', index=False)

In [125]:
x.to_html('otuput.html')

### Grouping

In [128]:
gr = df.groupby('class')

In [129]:
gr.get_group('TE')

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [132]:
gr['marks'].agg(np.mean)

class
BE    67.752
TE    61.246
Name: marks, dtype: float64

In [133]:
gr['marks'].agg(np.sum)

class
BE    338.76
TE    306.23
Name: marks, dtype: float64

In [134]:
gr['marks'].agg(np.max)

class
BE    78.66
TE    69.66
Name: marks, dtype: float64

### Merge the dataframes

In [137]:
df1 = pd.read_csv('student5.csv')
df1

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [139]:
pd.concat([df, df1], ignore_index=True)

    roll     name class  marks  age
0      1     anil    TE  56.77   22
1      2     amit    TE  59.77   21
2      3   aniket    BE  76.88   19
3      4  ajinkya    TE  69.66   20
4      5     asha    TE  63.28   20
5      6   ayesha    BE  49.55   20
6      7     amar    BE  65.34   19
7      8    amita    BE  68.33   23
8      9     amol    TE  56.75   20
9     10    anmol    BE  78.66   21
10     1   surbhi    TE  67.44   23
11     2    sujay    TE  74.12   22
12     3  subhash    BE  82.44   21
13     4   sachin    TE  59.33   21
14     5  shalini    TE  63.45   20

In [140]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [141]:
x = ['M','M','M','M','F','F','M','F','M','M']

In [142]:
df['gender'] = x

In [143]:
df

   roll     name class  marks  age gender
0     1     anil    TE  56.77   22      M
1     2     amit    TE  59.77   21      M
2     3   aniket    BE  76.88   19      M
3     4  ajinkya    TE  69.66   20      M
4     5     asha    TE  63.28   20      F
5     6   ayesha    BE  49.55   20      F
6     7     amar    BE  65.34   19      M
7     8    amita    BE  68.33   23      F
8     9     amol    TE  56.75   20      M
9    10    anmol    BE  78.66   21      M

In [144]:
df['marks'] = df['marks'] + 0.5

In [145]:
df

   roll     name class  marks  age gender
0     1     anil    TE  57.27   22      M
1     2     amit    TE  60.27   21      M
2     3   aniket    BE  77.38   19      M
3     4  ajinkya    TE  70.16   20      M
4     5     asha    TE  63.78   20      F
5     6   ayesha    BE  50.05   20      F
6     7     amar    BE  65.84   19      M
7     8    amita    BE  68.83   23      F
8     9     amol    TE  57.25   20      M
9    10    anmol    BE  79.16   21      M